Revit 2027 API
DataStorage.Create Method
 Creates a new DataStorage element and adds it to the document.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static DataStorage Create(
	Document doc
)
Public Shared Function Create (
	doc As Document
) As DataStorage
public:
static DataStorage^ Create(
	Document^ doc
)
static member Create :
        doc : Document -> DataStorage
Parameters
doc Document
 Document to which the new element should be added.
Return Value
DataStorage
 The newly created DataStorage element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DataStorage Class
Autodesk.Revit.DB.ExtensibleStorage Namespace